_posts/personal/2017-11-06-the-eternal-phoenix.html
---
date: 2017-11-06
tags:
- music
- personal
author: Manoel Vilela
layout: post
title: The Eternal Phoenix
excerpt: A conceptual album about my mind
lang: en
categories: personal
comments: true
---
<p align="center">
<iframe style="border: 0; width: 350px; height: 786px;"
        src="https://bandcamp.com/EmbeddedPlayer/album=512666029/size=large/bgcol=333333/linkcol=0f91ff/transparent=true/" seamless>
  <a href="http://chaoticlambdas.bandcamp.com/album/the-eternal-phoenix">The Eternal Phoenix by Manoel Vilela @ Lerax</a>
</iframe>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Description</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a lot of introspection about all my life: in the nested deaths
and ressurections. Mainly about the depressing eras and fighting with
it. How is the sound of a mind like that? The album covers a random
composing music on these days. How can I say&#x2026; it's just about me.
</p>

<p>
For me, was always (and always will be) like a eternal phoenix cycle: dead inside, reborn. <b>Repeat</b>.
</p>

<p>
Thanks to <i>Boa</i> and <i>Vivaldi</i> creating so much awesome musics, the
<i>Mindblowing</i> and <i>Lost</i> tracks was covers of the respective music
authors: Vivaldi Tribute by Patrick Rondat and Duvet by <i>Boa</i>.
</p>

<p>
As extra track, I added later of publish date a old cover that I
recorded of <i>Cello Suit I Prelude in G</i> by <i>John Sebastian Bach</i>, but
the execution is just a sample (not completed).
</p>

<p>
All credits © and rights reserved ® to Manoel Vilela (λ.me?), released in June 11, 2016.
</p>
</div>
</div>
